/****************************************************************************/
/*                                                                          */
/*    新核科技(广州)有限公司                                                */
/*                                                                          */
/*    Copyright (C) 2022 CoreKernel Technology Guangzhou Co., Ltd           */
/*                                                                          */
/****************************************************************************/
/****************************************************************************/
/*                                                                          */
/*    LVGL 多国语言字符(简体中文                                            */
/*                                                                          */
/*    2022年05月02日                                                        */
/*                                                                          */
/****************************************************************************/
/*
 *    该文件为 UTF-8 编码与 CCS 默认 GBK 编码不符
 *    在 CCS 下查看显示乱码
 *    修改方法 Window->Preferences->Editors->Text Editors->Spelling->Encoding
 *
 *    - 希望缄默(bin wang)
 *    - bin@corekernel.net
 *
 *    官网 corekernel.net/.org/.cn
 *    社区 fpga.net.cn
 *
 */
#ifndef ZH_CN_H_
#define ZH_CN_H_

// 星期
char *WeekDayStr[] = {"星期日", "星期一", "星期二", "星期三", "星期四", "星期五", "星期六"};
	
char *tempstr = "温度 湿度";


#endif
