/****************************************************************************/
/*                                                                          */
/*    新核科技(广州)有限公司                                                */
/*                                                                          */
/*    Copyright (C) 2022 CoreKernel Technology (Guangzhou) Co., Ltd         */
/*                                                                          */
/****************************************************************************/
/*
 *    - 希望缄默(bin wang)
 *    - bin@corekernel.net
 *
 *    官网 corekernel.net/.org/.cn
 *    社区 fpga.net.cn
 *
 */
#include <xdc/std.h>

#include "Log.h"

/****************************************************************************/
/*                                                                          */
/*              SysMin 支持                                                 */
/*                                                                          */
/****************************************************************************/
Void ConsoleLogger(Char *buf, UInt size)
{
    ConsoleWrite("%s", buf);
}
