/****************************************************************************/
/*                                                                          */
/*    新核科技(广州)有限公司                                                */
/*                                                                          */
/*    Copyright (C) 2022 CoreKernel Technology (Guangzhou) Co., Ltd         */
/*                                                                          */
/****************************************************************************/
/****************************************************************************/
/*                                                                          */
/*    LED 数码管                                                            */
/*                                                                          */
/*    2022年03月16日                                                        */
/*                                                                          */
/****************************************************************************/
/*
 *    修订历史
 *    2022/03/16  初始版本
 *    2022/04/28  改为 PRU 控制
 *
 *    - 希望缄默(bin wang)
 *    - bin@corekernel.net
 *
 *    官网 corekernel.net/.org/.cn
 *    社区 fpga.net.cn
 *
 */
#include <App.h>

#include "../PRU/PRULoader.h"

#include "../PRU/LEDNixie_PRU_Code.h"
#include "../PRU/LEDNixie_PRU_Data.h"

/****************************************************************************/
/*                                                                          */
/*              全局变量                                                    */
/*                                                                          */
/****************************************************************************/
/*
 *        A
 *      ┏━━━┓
 *    F ┃ G ┃ B
 *      ┣━━━┫
 *    E ┃   ┃ C
 *      ┗━━━┛. DP
 *        D
 */
unsigned char *LEDNixieVal = (unsigned char *)0x01C30000;  // PRU0 数据内存

/****************************************************************************/
/*                                                                          */
/*              初始化                                                      */
/*                                                                          */
/****************************************************************************/
void LEDNixieInit()
{
    // 加载并运行 PRU 程序
    PRUEnable(PRU_CORE0);
    PRULoad(PRU_CORE0, (unsigned int*)PRU_Code, (sizeof(PRU_Code) / sizeof(unsigned int)), (unsigned int*)PRU_Data, (sizeof(PRU_Data) / sizeof(unsigned int)));
    PRURun(PRU_CORE0);
}
