/****************************************************************************/
/*                                                                          */
/*    新核科技(广州)有限公司                                                */
/*                                                                          */
/*    Copyright (C) 2022 CoreKernel Technology (Guangzhou) Co., Ltd         */
/*                                                                          */
/****************************************************************************/
/****************************************************************************/
/*                                                                          */
/*    LED 点阵                                                              */
/*                                                                          */
/*    2022年03月28日                                                        */
/*                                                                          */
/****************************************************************************/
/*
 *    - 希望缄默(bin wang)
 *    - bin@corekernel.net
 *
 *    官网 corekernel.net/.org/.cn
 *    社区 fpga.net.cn
 *
 */
#include <App.h>

#include "PRU_Code.h"

/****************************************************************************/
/*                                                                          */
/*              宏定义                                                      */
/*                                                                          */
/****************************************************************************/
#define PRU_CORE0  0
#define PRU_CORE1  1

/****************************************************************************/
/*                                                                          */
/*              初始化                                                      */
/*                                                                          */
/****************************************************************************/
void LEDMatrixInit()
{
    /* 使用 RISC 核心 PRU 控制 */
    // 唤醒 PRU 核心
    PSCModuleControl(SOC_PSC_0_REGS, HW_PSC_PRU, PSC_POWERDOMAIN_ALWAYS_ON, PSC_MDCTL_NEXT_ENABLE);

    // 加载并运行 PRU 程序
    PruDisable(PRU_CORE0);

    PruLoad(PRU_CORE0, (unsigned int*)PRU_Code, (sizeof(PRU_Code) / sizeof(unsigned int)));

    PruRun(PRU_CORE0);
}
