/****************************************************************************/
/*                                                                          */
/*    新核科技(广州)有限公司                                                */
/*                                                                          */
/*    Copyright (C) 2022 CoreKernel Technology (Guangzhou) Co., Ltd         */
/*                                                                          */
/****************************************************************************/
/****************************************************************************/
/*                                                                          */
/*    LED 数码管                                                            */
/*                                                                          */
/*    2022年03月16日                                                        */
/*                                                                          */
/****************************************************************************/
/*
 *    修订历史
 *    2022/03/16  初始版本
 *    2022/04/28  改为 PRU 控制
 *
 *    - 希望缄默(bin wang)
 *    - bin@corekernel.net
 *
 *    官网 corekernel.net/.org/.cn
 *    社区 fpga.net.cn
 *
 */
#include <App.h>

#include "PRULoader.h"

#include "PRU_Code.h"

/****************************************************************************/
/*                                                                          */
/*              全局变量                                                    */
/*                                                                          */
/****************************************************************************/
/*
 *        A
 *      ┏━━━┓
 *    F ┃ G ┃ B
 *      ┣━━━┫
 *    E ┃   ┃ C
 *      ┗━━━┛. DP
 *        D
 */
#pragma DATA_SECTION(LEDNixieVal, ".LEDNixieVal")
unsigned char LEDNixieVal[4];         // 数码管值

unsigned char SEGVal[16] =
{
    0xC0, 0xF9, 0xA4, 0xB0, 0x99,     // 0 1 2 3 4
    0x92, 0x82, 0xF8, 0x80, 0x90,     // 5 6 7 8 9
    0x88, 0x83, 0xC6, 0xA1, 0x86,     // A B C D E
    0x8E                              // F
};

/****************************************************************************/
/*                                                                          */
/*              初始化                                                      */
/*                                                                          */
/****************************************************************************/
void LEDNixieInit()
{
    // 加载并运行 PRU 程序
    PRULoad(PRU0, (unsigned int *)PRU_Code, (sizeof(PRU_Code) / sizeof(unsigned int)), 0, 0);
    PRURun(PRU0);
}
