/****************************************************************************/
/*                                                                          */
/*    新核科技(广州)有限公司                                                */
/*                                                                          */
/*    Copyright (C) 2022 CoreKernel Technology (Guangzhou) Co., Ltd         */
/*                                                                          */
/****************************************************************************/
/****************************************************************************/
/*                                                                          */
/*    定时器                                                                */
/*                                                                          */
/*    2014年07月03日                                                        */
/*                                                                          */
/****************************************************************************/
/*
 *    - 希望缄默(bin wang)
 *    - bin@corekernel.net
 *
 *    官网 corekernel.net/.org/.cn
 *    社区 fpga.net.cn
 *
 */
// 全局定义
#include <App.h>

/****************************************************************************/
/*                                                                          */
/*              宏定义                                                      */
/*                                                                          */
/****************************************************************************/
// LED 状态
#define LED_OFF     0
#define LED_ON      1

/****************************************************************************/
/*                                                                          */
/*              硬件中断线程                                                */
/*                                                                          */
/****************************************************************************/
// LED 操作
char LED_OP = LED_OFF;

Void TimerHwi(UArg arg)
{
    LED_OP = !LED_OP;
    LEDControl(SOM_LED3, LED_OP);
}

/****************************************************************************/
/*                                                                          */
/*              定时器初始化                                                */
/*                                                                          */
/****************************************************************************/
Void TimerInit()
{
    Timer_Params TimerParams;
    Timer_Params_init(&TimerParams);

    // 配置周期
    TimerParams.period = 1000000;  // 1 秒
    TimerParams.periodType = Timer_PeriodType_MICROSECS;

    // 中断号
    TimerParams.intNum = 12;

    // 实例化定时器
    Timer_create(Timer_ANY, TimerHwi, &TimerParams, NULL);
}
